{"config": [{"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 80], "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "use_bias": true, "activation": "linear", "units": 80, "name": "dense_1", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "leaky_relu", "units": 189, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "leaky_relu", "units": 189, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "leaky_relu", "units": 189, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "leaky_relu", "units": 189, "name": "dense_5", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "leaky_relu", "units": 149, "name": "dense_6", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "dtype": "float32", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "dtype": "float32", "use_bias": true, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "activation": "leaky_relu", "units": 1, "name": "dense_7", "bias_regularizer": null, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5-tf"}