{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 16, "kernel_constraint": null, "use_bias": true, "dtype": "float32", "name": "dense_1", "bias_constraint": null, "batch_input_shape": [null, 16], "activation": "linear", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "activation": "leaky_relu", "name": "dense_2", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 512, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "activation": "leaky_relu", "name": "dense_3", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "dtype": "float32", "seed": null}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "kernel_constraint": null, "dtype": "float32", "use_bias": true, "bias_constraint": null, "activation": "leaky_relu", "name": "dense_4", "trainable": true}}], "keras_version": "2.1.5-tf"}